In [2]:
import pandas as pd

 

data = {
    "names":['a','b','c'],
    "ages":[25,28,21]
}

 

df = pd.DataFrame(data)

df

  names  ages
0     a    25
1     b    28
2     c    21

In [4]:
df.head(2)

  names  ages
0     a    25
1     b    28

In [6]:
df.describe()

            ages
count   3.000000
mean   24.666667
std     3.511885
min    21.000000
25%    23.000000
50%    25.000000
75%    26.500000
max    28.000000

In [10]:
df.columns=["emp_name","age"]
df

  emp_name  age
0        a   25
1        b   28
2        c   21

In [12]:
df2=df.rename(columns={"emp_name":"emp_first_name","age":"emp_age"})
df2

  emp_first_name  emp_age
0              a       25
1              b       28
2              c       21

In [14]:
dept=['Sales','Marketing','IT']

In [18]:
df2=df2.assign(Company=dept)

In [20]:
df2.dtypes

emp_first_name    object
emp_age            int64
Company           object
dtype: object

In [22]:
df3=df2.convert_dtypes()#infers the column schema

In [26]:
df3.dtypes #all objects converted to string

emp_first_name    string
emp_age            Int64
Company           string
dtype: object

In [29]:
df4=df2.astype({"emp_age":float})

In [31]:
df4.dtypes

emp_first_name     object
emp_age           float64
Company            object
dtype: object

In [33]:
df.shape

(3, 2)

In [35]:
df.shape[0]#no of rows

3

In [37]:
df.shape[1]#no of columns

2

In [41]:
technologies = {
    'Courses':["Spark","PySpark","Hadoop","Python","pandas"],
    'Fee' :[20000,25000,26000,22000,24000],
    'Duration':['30day','40days','35days','40days','60days'],
    'Discount':[1000,2300,1200,2500,2000]
              }

index_label=['r1','r2','r3','r4','r5']
cdf=pd.DataFrame(technologies, index=index_label)
cdf

    Courses    Fee Duration  Discount
r1    Spark  20000    30day      1000
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1200
r4   Python  22000   40days      2500
r5   pandas  24000   60days      2000

In [43]:
#df.loc[start:stop:step(to select rows),start:stop:step(to select columns)]
cdf.loc['r1']

Courses     Spark
Fee         20000
Duration    30day
Discount     1000
Name: r1, dtype: object

In [44]:
cdf.loc[['r1','r2']]

    Courses    Fee Duration  Discount
r1    Spark  20000    30day      1000
r2  PySpark  25000   40days      2300

In [46]:
cdf.loc[:,['Courses']]

    Courses
r1    Spark
r2  PySpark
r3   Hadoop
r4   Python
r5   pandas

In [50]:
cdf.loc[:,['Courses','Fee']]

    Courses    Fee
r1    Spark  20000
r2  PySpark  25000
r3   Hadoop  26000
r4   Python  22000
r5   pandas  24000

In [53]:
cdf.loc["r2":"r4"]#slicer

    Courses    Fee Duration  Discount
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1200
r4   Python  22000   40days      2500

In [55]:
cdf.loc[cdf["Fee"]==22000]

   Courses    Fee Duration  Discount
r4  Python  22000   40days      2500

In [60]:
cdf.query("Courses=='PySpark'") #IMPORTANT

    Courses    Fee Duration  Discount
r2  PySpark  25000   40days      2300

In [62]:
cdf.query("Courses!='PySpark'")

   Courses    Fee Duration  Discount
r1   Spark  20000    30day      1000
r3  Hadoop  26000   35days      1200
r4  Python  22000   40days      2500
r5  pandas  24000   60days      2000

In [66]:
cdf=cdf.drop(["Discount"],axis=1)
#alternate way:
#df.drop(columns=["Discount"])
cdf

    Courses    Fee Duration
r1    Spark  20000    30day
r2  PySpark  25000   40days
r3   Hadoop  26000   35days
r4   Python  22000   40days
r5   pandas  24000   60days